<?php
// +----------------------------------------------------------------------
// | PHPSpider [ A PHP Framework For Crawler ]
// +----------------------------------------------------------------------
// | Copyright (c) 2016-2018 All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: Masterton zheng <zhengcloud@foxmail.com>
// +----------------------------------------------------------------------

//----------------------------------
// PHPSpider Curl操作类
//----------------------------------

namespace PHPSpider\Library;

class RollingCurl
{
    /**
     * @var float
     *
     * 同时运行任务数
     * 例如: 有8个请求,则会被分成两批,第一批5个请求,第二批3个请求
     * 注意: 采集知乎的时候,5个比较稳定,7个以上就开始会超时,多进程就没有这样的问题
     * 因为多进程很少几率会放生并发
     */
    public $window_size = 5;
}
